19-intro-to-rails/rails-recipes-app/app/controllers/recipes_controller.rb

  def create
    byebug
    @recipe = Recipe.create(params[:recipe])
---
INSERT INTO "recipes" ("title", "duration", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asdf"], ["duration", 10], ["user_id", 24], ["created_at", "2022-06-24 19:26:14.298937"], ["updated_at", "2022-06-24 19:26:14.298937"]]