rails-validation/app/controllers/awkward_pauses_controller.rb

INSERT INTO "awkward_pauses" ("location", "topic", "minutes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["location", "asdf"], ["topic", "asdf"], ["minutes", 10], ["created_at", "2022-06-28 18:40:02.255043"], ["updated_at", "2022-06-28 18:40:02.255043"]]
---
  def create
    @awkward_pause = AwkwardPause.new(awkward_pause_params)
    byebug

    # if its valid
    if @awkward_pause.valid?
      @awkward_pause.save # save to the db

DELETE FROM "awkward_pauses" WHERE "awkward_pauses"."id" = ?  [["id", 30]]
---
  def destroy
    @awkward_pause.destroy