19-intro-to-rails/rails-recipes-app/app/views/recipes/new.erb


  <%= f.collection_select(:user_id, User.all, :id, :name) %>
---
SELECT "users".* FROM "users"